{
	kind = 12;		//1-�����@2-�@�B
	weight	 = 10;	//�d��
	HP		 = 10;	//�̗�
	preHP		 = HP;
	point		 = 5;	//���_
	walk		 = 2+random(2);	//��s�X�s�[�h
	run		 = 4+random(2);	//���s�X�s�[�h

	NoticeDis	 = 200;	//��������
	NearestDis	 = 0;	//�ڋߋ���
	NoticeZone	 = false;	//�����t���O

	AtkPoint_1	 = 0;	//�U�������n�_
	AtkPoint_2	 = 5;	//�U�������I�_
	AtkZone		 = false;	//�U���t���O

	/*----------*/
	step = 0;
	hspd = 0;		//���������X�s�[�h
	bind = 0;			//�S���t���O
	move= 0;		//�ړ����t���O
	dir = 0;			//0-��		1-�E
	air = 0;			//0-�n��	1-��
}
/* */
/*  */
