{
	kind = 3;		//1-�����@2-�@�B
	weight		 = 30;	//�d��
	HP		 = 1;	//�̗�
	preHP		 = HP;
	point		 = 0;	//���_
	walk		 = 0;	//��s�X�s�[�h
	run		 = 0;	//���s�X�s�[�h

	NoticeDis	 = 0;	//��������
	NearestDis	 = 0;	//�ڋߋ���
	NoticeZone	 = false;	//�����t���O

	AtkPoint_1	 = 0;	//�U�������n�_
	AtkPoint_2	 = 0;	//�U�������I�_
	AtkZone		 = false;	//�U���t���O

	/*----------*/
	step = 0;
	hspd = 0;		//���������X�s�[�h
	bind = 0;			//�S���t���O
	move= 0;		//�ړ����t���O
	dir = 0;			//0-��		1-�E
	air = 0;			//0-�n��	1-��
}
/* */
flag = 0;
image_alpha = 0.6;
/* */
/*  */
