function mbtext_setfont(argument0, argument1, argument2) {
	{
	   /********************************************************************************
	    * (ver 1.4.0)
	    * mbtext_setfont(spr_zen, spr_han, size)
	    *
	    * �e�L�X�g�`��p�̃t�H���g(�X�v���C�g)�ƃT�C�Y��ݒ肷��B
	    * mbtext_draw()��Ăяo���O�ɕK�����̊֐�����s���Ă������ƁB
	    *
	    * -sprite spr_zen  :�S�p�����p�̃X�v���C�g
	    * -sprite spr_han  :���p�����p�̃X�v���C�g
	    * -int    size     :1����������̃s�N�Z�����B
	    *                   �X�v���C�g�ɍ��킹�Đ��m�Ɏw�肵�Ȃ��ƕ`��ł��Ȃ��Ȃ�B
	    *
	    * return           :�߂�l����
	    ********************************************************************************/
	   global.sprite_for_mb_zen = argument0;    // �S�p�����psprite
	   global.sprite_for_mb_han = argument1;    // ���p�����psprite
	   global.mbchar_size = argument2;          // 1����������̃T�C�Y�B���p�����̉����͂���1/2
	   exit;
	}



}
