{
	kind = 1;		//1-�����@2-�@�B
	weight	 = 1000000000;	//�d��
	HP		 = 200;	//�̗�
	preHP		 = HP;
	point		 = 10;	//���_
	walk		 = 1+random(2);	//��s�X�s�[�h
	run		 = 2+random(2);	//���s�X�s�[�h

	NoticeDis	 = 100;	//��������
	NearestDis	 = 30;	//�ڋߋ���
	NoticeZone	 = false;	//�����t���O

	AtkPoint_1	 = 0;	//�U�������n�_
	AtkPoint_2	 = 50;	//�U�������I�_
	AtkZone		 = false;	//�U���t���O

	/*----------*/
	step = 0;
	hspd = 0;		//���������X�s�[�h
	bind = 0;			//�S���t���O
	move= 0;		//�ړ����t���O
	dir = 0;			//0-��		1-�E
	air = 0;			//0-�n��	1-��
	image_speed = 0.4;
step = 0;
flag = 0;
flag2 = 0;
fl =0;
}
/* */
/*  */
